Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: how can you prevent wastage of electricity in your home ?
af: hoe kan jy elektrisiteitsvermorsing in jou huis voorkom ?

source: name four possible ways .
af: noem 4 moontlike maniere .

source: use energy saving light bulbs install a solar water heater switch off all electrical devices that are not in use and use as little hot water as possible .
af: gebruik energiebesparende gloeilampe installeer 'n waterverwarmer wat met son werk skakel alle elektriese toestelle wat nie gebruik word nie af gebruik so min asmoontlik warm water .

source: we discussed a world without electricity and we all realised how dependent we are on this resource .
af: ons het reeds bespreek hoe 'n w&#234;reld sonder elektrisiteit sou wees en ons het besef hoe afhanklik ons van hierdie hulpbron is .

source: it is illegal for anyone to use electricity that was generated by eskom without their permission .
af: dit isonwettig vir enige iemand om elektrisiteit wat deur eskom opgewek is sonder hulle toestemming te gebruik .

source: some people make illegal connections because they don't want to pay for the electricity .
af: party mense maak onwettige skakelings omdat hulle nie wil betaal vir elektrisiteit nie .

source: they cut through the insulation in a power line and attach other cables to this line .
af: hulle sny deur die isolasiemateriaal van 'n kraglyn en heg ander kabels aan die lyn .

source: they can then direct some electricity to their house or workplace .
af: hulle lei dan hierdie elektrisiteit direk na hulle huise of werkplekke .

source: these connections are dangerous to people as they are often unsafe .
af: hierdie skakelings is gevaarlikvir mense omdat hulle onveilig is .

source: people who make illegal connections try to get electricity for free but the dangers are not worth it .
af: mense wat onwettige skakelings maak probeer elektrisiteit verniet kry maar die gevare wat daarmee saamgaan is nie die moeite werd nie .

source: it is not worth your life !
af: dit is nie jou lewe werd nie !

source: accidents caused by electricity happen all the time .
af: ongelukke wat deur elektrisiteit veroorsaak word gebeur gereeld .

source: people often get hurt or even killed by electricity because they do not use it safely .
af: mense word gereeld beseer of word selfs doodgemaak deur elektrisiteit omdat hulle dit nie veilig gebruik nie .

source: not only is it important to know how to use electricity safely but also what to do if someone is hurt or shocked by electricity .
af: dit is nie net belangrik om te weet hoe om elektrisiteit veilig te gebruik nie maar ook wat om te doen as iemand seerkry of geskok word deur elektrisiteit .

source: what types of emergencies can happen at home or at school with electricity ?
af: watter soorte noodgevalle kan by die huis of skool plaasvind as gevolg van elektrisiteit ?

source: someone could get a shock on a plug or exposed wire someone could put an electrical appliance in or near water and get a shock there could be a power outage and when someone is trying to fix the problem they could get shocked etc
af: iemand kan geskok word deur 'n oop kragprop of onbedekte draad iemand kan 'n elektriese toestel in of naby water gebruik en skok daar kan 'n kragonderbreking wees en wanneer iemand die probleem probeer reg maak kan hulle skok ens .

source: find out about the emergency services in your area and write down their names and telephone numbers .
af: vind uit oor die nooddienste in jou area en skryf hulle name en telefoonnommers neer .

source: also write this information on a piece of paper and stick it to the wall next to your phone or in a central place in your home .
af: skryf hierdie inligting ook op 'n stuk papier en plak dit op die muur naby jou telefoon of &#234;rens waar almal in jou huis dit kan sien .

source: consider inviting an electrician to talk about electricity and safety to the class .
af: oorweeg dit om 'n elektrisi&#235;n te kry om oor elektrisiteit en veiligheid met die klas te praat .

source: accidents with electricity can be avoided .
af: ongelukke met elektrisiteit kan vermy word .

source: we just need to be smart about working with electricity .
af: ons moet net slim met elektrisiteit werk .

source: let's formulate some safety rules for working with electricity .
af: kom ons formuleer 'n paar veiligheidsre&#235;ls vir wanneer daar met elektrisiteit gewerk word .

source: this was done in gr. 5 but it is a good idea to revise it again as electrical accidents often happen in the home and at school .
af: dit is reeds in graad 5 gedoen maar dit is 'n goeie idee om dit weer te herhaal aangesien ongelukke met elektrisiteit gereeld by die huis of skool gebeur .

source: electricity does not flow .
af: elektrisiteit vloei nie elektriese strome vloei .

source: electric current flows .
af: wees versigtig vir misverstande .

source: the person in the illustration above is using a table knife to remove a coin that has fallen in the toaster before switching off the appliance .
af: die persoon in die illustrasie gebruik 'n tafelmes om 'n muntstuk wat in 'n broodrooster geval het uit te haal sonder om die toestel af te skakel .

source: what are the dangers related to this act ?
af: wat is die gevare van hierdie aksie ?

source: the person can get shocked as electricity can pass from the toaster through the metal knife and through the person .
af: die persoon kan skok want elektrisiteit kan van die broodrooster deur die metaalmes na die persoon beweeg .

source: what safety rule can you formulate regarding this ?
af: watter veiligheidsre&#235;l kan jy formuleer oor hierdie situasie ?

source: first turn the toaster off and unplug it and use a wooden or plastic knife .
af: sit eers die broodrooster af en trek die prop uit en gebruik dan 'n hout of plastiekmes .

source: what could be done to the cable to make it safe to use ?
af: wat kan jy doen om die koord veilig te maak vir ons om te gebruik ?

source: replace the cord or else wrap insulation tape around the broken cord .
af: vervang die koord of bind isoleerband om die gebreekte koord .

source: however this will not prevent a short if the wires inside also have perished insulation .
af: dit sal egter nie 'n kortsluiting voorkom as die drade binne in ook isoleermateriaal het wat verweer het nie .

source: it is best to replace the cord .
af: dit is beter om die koord te vervang .

source: never use an appliance that has a broken cord or has some of the metal wire showing through the cord casing .
af: moet nooit 'n toestel gebruik wat 'n stukkende koord het of waar metaaldraad deur die oordomhulsel wys nie .

source: why is it dangerous to pull the boy from the electric wire ?
af: waarom is dit gevaarlik om die seun van die elektriese draad af te trek ?

source: electric current can flow from one person to the next so you will also get shocked .
af: elektrisiteit kan van een persoon na die volgende vloei so jy sal ook skok .

source: what can the helper do to save the boy without being shocked by the electricity ?
af: wat kan die persoon wat wil help doen om die seun te red sonder om ook deur die elektrisiteit geskok te word ?

source: use a non plastic non metal object to separate them from the electrical source .
af: gebruik 'n nie metaal plastiekvoorwerp om hom van die elektriese bron te verwyder .

source: never try to pull someone who is being shocked away from the appliance .
af: moet nooit iemand wat geskok word probeer wegtrek van die toestel nie .

source: why is this not a safe place to play ?
af: waarom is hierdie nie 'n veilige plek om te speel nie ?

source: high voltage fences can shock you even if you stand near them without actually touching them or you might accidentally bump against the fence .
af: ho&#235; spanningsheinings kan jou skok selfs al staan jy naby aan hulle sonder om regtig daaraan te vat of jy mag dalk per ongeluk teen die heining stamp .

source: never play near to or on electric fences or power lines .
af: moet nooit naby of op elektriese heinings of kraglyne speel nie .

source: why is this connection dangerous ?
af: waarom is die verbindings gevaarlik ?

source: too much electric current flowing to one plug is dangerous .
af: te veel elektrisiteit wat deur een kragprop vloei is gevaarlik .

source: one multi plug adapter is safe but do not put adapters into each other .
af: een veelpuntige proppasstuk is veilig maar moenie verskillende passtukke in mekaar sit nie .

source: rather use 2 different plug points .
af: gebruik eerder 2 verskillende kragpunte .

source: teacher's note the real danger is that overloading the plug causes heating of the circuit which can result in fire .
af: die regte gevaar is dat deur die prop te oorlaai die stroombaan kan verhit en dit kan &#8216;n brand veroorsaak .

source: never put too many appliances into one socket .
af: moet nooit te veel toestelle in een kontaksok sit nie .

source: why is it dangerous for the children to play outside during the lightning storm ?
af: waarom is dit gevaarlik vir kinders om buite te speel as daar 'n weerligstorm in die lug is ?

source: if this powerful natural electricity strikes close to you it will try to get to the ground through you .
af: as hierdie kragtige natuurlike energie naby aan jou slaan sal dit deur jou by die grond probeer uitkom .

source: our bodies are good conductors of electricity .
af: ons liggame is goeie geleiers van elektrisiteit .

source: why should no one play under a tree when it is storming ?
af: waarom moet ons nie onder 'n boom speel as daar 'n storm is nie ?

source: the lightning is attracted to high points such as a tree and can shock the tree and also kill anyone underneath it .
af: die weerlig word deur ho&#235; punte soos die boom aangetrek en kan die boom skok en enigiemand onder dit doodmaak .

source: explain why it is not a good idea to be swimming when there is lightning in the sky ?
af: verduidelik waarom dit nie 'n goeie idee is om te swem as daar weerlig in die lug is nie .

source: lightning could strike the water .
af: weerlig kan in die water slaan .

source: water with dissolved substances such as salt or chlorine is a good conductor of electricity and you can get shocked and possibly die if you are swimming .
af: water met opgeloste stowwe soos sout of chloor daarin is 'n goeie geleier van elektrisiteit en jy kan skok en moontlik doodgaan as jy swem .

source: what safety rules can you formulate regarding lightning ?
af: watter veiligheidsmaatre&#235;ls kan jy formuleer oor weerlig ?

source: do not play outside when there is thunder and lightning .
af: moenie buite speel as daar donderweer en weerlig is nie .

source: why is the gardener unsafe when mowing the lawn in the rain ?
af: waarom is 'n tuinier onveilig as hy die gras in die re&#235;n sny ?

source: give at least two reasons .
af: gee ten minste twee redes .

source: water is able to conduct electricity so you can get a shock if you are touching an appliance and water drips into the socket cord or motor .
af: water gelei elektrisiteit jy kan daarom skok as jy aan 'n toestel vat wanneer water in die kontaksok koord of motor drup .

source: secondly he is not wearing shoes which is dangerous as he could cut himself and the current can flow through him and into the earth .
af: hy dra ook nie skoene nie .

source: what safety rules can you formulate regarding using electrical appliances outside in the garden ?
af: watter veiligheidsmaatre&#235;ls kan jy formuleer vir wanneer elektriese toestelle buite in die tuin gebruik word .

source: never use electrical appliances outdoors in wet weather or if you are wet .
af: moet nooit elektriese toestelle buite in nat weer gebruik of as jy nat is nie .

source: wear shoes when using electrical appliances .
af: dra skoene wanneer jy elektriese toestelle gebruik .

source: we have seen above that fossil fuels are non renewable resources of energy .
af: ons het hierbo gesien dat fossielbrandstowwe nie hernubare energiebronne is .

source: what do you understand by the word non renewable' ?
af: wat verstaan jy as jy die woord nie hernubaar lees ?

source: this means it cannot be renewed reused .
af: dit beteken dit kan nie hernu word of weer gebruik word nie .

source: there is a finite supply which will be used up one day .
af: daar is 'n beperkte hoeveelheid wat eendag opgebruik sal word .

source: so if we are using an energy resource which is non renewable then this will be a problem in the future when these resources run out .
af: as ons dus 'n energiebron gebruik wat nie hernubaar is watter probleem sal ons in die toekoms h&#234; as die hulpbronne opraak ?

source: are there other sources of energy ?
af: is daar ander bronne van energie ?

source: scientists and engineers are looking for ways to harness energy from renewable resources .
af: wetenskaplikes en ingenieurs soek maniere om energie aan te wend deur hernubare bronne .

source: a renewable resource is the opposite to a non renewable resource .
af: 'n hernubare bron is die teenoorgestelde van 'n nie hernubare bron .

source: it will not run out and can be used over .
af: dit sal nooit opraak nieen kan oor en oor gebruik word .

source: renewable energy sources include natural phenomena such as sunlight wind tides and plant growth .
af: hernubare energiebronne sluit natuurlike verskynsels soos sonlig wind getye en plantegroei in .

source: the energy comes from natural processes that happen over and over .
af: die energie kom van die natuurlike prosesse wat oor en oor gebeur

source: renewable energy video http www.youtube.com watch?v otywew5meio
af: hernubare energie video . goo.gl wkyhb

source: why do you think natural phenomena such as sunlight and wind can be considered as renewable ?
af: waarom dink jy kan natuurlike verskynsels soos sonlig en wind as hernubare bronne beskou word ?

source: this is because the sunlight and the wind will not run out' .
af: elkeen wys iemand wat iets anders met elektrisiteit doen; die persoon doen iets gevaarlik .

source: this is another place to speak of orders of magnitude .
af: hierdie is nog 'n plek waar ons oor die volgorde van grootte moet praat .

source: these resources are available so long as the solar system lasts in its current form roughly 3.5 billion years they say .
af: hierdie hulpbronne is beskikbaar so lank as wat diesonnestelsel in sy huidige vorm bly bestaan vir omtrent nog 3.5 biljoen jaar s&#234; hulle .

source: so these are renewable because they will always be available to us as a species even if we last a few million years more having only really been around about 150 000 years or so .
af: hierdie bronne is dus hernubaar omdat ditaltyd vir ons as 'n spesie beskikbaar sal wees selfs al bestaan ons vir nog 'n paar miljoen jaar ons is eintlik maar nog net 150 000 jaar lank op die aarde .

source: examples of renewable energy resources are
af: voorbeelde van hernubare energiebronne is

source: sun wind and water can be used as sources of energy .
af: son wind en water kan as bronne van energie gebruik word .

source: solar panels can be fitted to houses but this source of renewable energy works best on sunny days and is less effective on cloudy days .
af: sonpanele kan op huise aangebring word maar hierdie bron van hernubare energie is slegs op sonskyndae beskikbaar .

source: wind energy can be collected with a windmill or wind turbine which can be big and noisy .
af: windenergiekan deur 'n windmeul of windturbines wat groot en raserig kan wees opgegaar word .

source: hydroelectric power stations harness the energy in water stored in high dams .
af: hidro elektriesekragstasies wend die energie in water wat in damme gestoor word aan .

source: it is only possible in areas where there are high mountains and rivers .
af: dit is net moontlik in areas waar daar ho&#235; berge en riviere is .

source: solar panels which convert the sunlight energy to produce electrical energy are also called photovoltaics .
af: sonpanele wat sonenergie omskakel na elektriese energie word ook fotovolta&#239;es genoem .

source: there are also solar water heaters but this is a different system to solar panels .
af: daar is ook sonkrag waterverhitters maar dit is 'n ander stelse as sonpanele .

source: solar heaters directly heat water .
af: sonverhitters maak die water direk warm .

source: wind energy video http www.youtube.com watch?v f3bzzoymhki&amp;feature player embedded
af: windenergie video http www.youtube.com watch?v f3bzzoymhki&amp;feature player embedded

source: the first windmills were developed in persia in about 600 b.c .
af: die eerste windmeule is in persi&#235; onwikkel ongeveer 600 vc .

source: but the first windmill to produce electricity was in denmark in 1890 .
af: die eerste windmeul wat egter elektrisiteit opgewek het was in denemarke in 1890 .

source: south africa also has large reserves of uranium which are used in the koeberg nuclear power station .
af: suid afrika het ook 'n groot reserwe uranium wat gebruik word in die koeberg kernkragstasie .

source: learning how to debate is an important skill .
af: om te leer om te debatteer is 'n belangrike vaardigheid .

source: after doing this activity you could practise debating skills in the class by getting two groups to discuss opposing sides of the story .
af: nadat jy hierdie aktiwiteit gedoen het kan jy jou debatvaardighede indie klas oefen deur twee groepe aan teenoorgestelde kante van die argument te kry .

source: each group must understand that they have to justify an argument for each side of the debate .
af: elke groep moet verstaan dat hulle elkeargument aan albei kante van die argument moet kan motiveer .

source: what are the advantages and disadvantages of renewable and non renewable sources ?
af: wat is die voordele en nadele van hernubare en nie hernubare bronne ?

source: there is a lot of debate around the use of renewable and non renewable sources for energy .
af: daar is 'n groot debat rondom die gebruik van hernubareen nie hernubare bronne van energie .

source: let's join this debate !
af: kom ons neem deel aan die debat .

source: how hydroelectricity works video http www.youtube.com watch?v rnpetwqtmgq
af: hoe hidro elektrisiteit werk. video goo.gl j6oz1

source: if time permits learners can do a mini research project on one of the renewable energy resources and present a poster in which they answer questions such as how is this renewable energy resource harvested and used to produce electricity?' is this resource used in south africa?' etc .
af: as die tyd dit toelaat kan leerders 'n mini navorsingsprojek oor een van die hernubare energiehulpbronne doen en 'n plakkaat aan dieklas aanbied waarin hulle vrae soos hoe word die hernubare energie ingewin en gebruik om elektrisiteit te produseer?&#8221;. word die hulpbron in suid afrika gebruik?&#8221; .

source: these can be stuck up as posters in the classroom for others in the class to read and learn from .
af: hierdie plakkate kan in die klaskamer opgeplak word sodat die res van die klas dit kan lees en daaruit kan leer .

source: the sun produces energy which plants capture and use to make food through the process of photosynthesis .
af: die son produseer energie wat die plante vasvang en gebruik om kos te produseer deur fotosintese .

source: animals eat the plants .
af: diere eet die plante .

source: when these prehistoric plants and animals died millions of years ago their remains were turned into fossil fuels such as coal oil and natural gas over a long time .
af: toe die prehistoriese plante en diere miljoene jare gelede gesterf het het die oorblyfsels in fossielbrandstowwe soos steenkool olie en aardgasse verander .

source: this was due to being covered in layers of sediment of mud and water which over time turned into rock and exerted a great pressure and heat on the remains .
af: dit was omdat hullemet lae sediment of modder en water bedek is wat mettertyd in rots verander het en groot druk en hitte op die oorblyfsels uitgeoefen het .

source: today these fossil fuels are mined and collected from inside the earth's crust .
af: hierdie fossielbrandstowwe word vandag gemyn en van binne die aarde se kors bymekaargemaak .

source: oil is processed to make petrol and diesel and the energy from the fossil fuels is used for example in cars where it is burnt and the energy released powers the cars .
af: olie word verwerk om petrol en diesel te maak en die energie van die fossielbrandstof word byvoorbeeld in motors gebruik waar dit gebrand word en die energie vrygestel word sodat die motor kan beweeg .

source: why are fossil fuels considered non renewable resources ?
af: waarom is fossielbrandstowwe nie hernubare hulpbronne ?

source: this is because there is a limited supply of fossil fuels which will run out one day as we are using fossil fuels faster than they are made which takes millions of years .
af: dit is omdat daar 'n beperkte hoeveelheid fossielbrandstowwe is wat eendag sal opraak omdat ons fossielbrandstowwe vinniger gebruik as wat hulle gemaak word wat miljoene jareneem .

source: they cannot be reused .
af: dit kan nie weer gebruik word nie .

source: write a paragraph in which you explain why you think humans should investigate alternative energy sources such as renewable energy sources and how this might help the earth .
af: skryf 'n paragraaf waarin jy beskryf hoekom jy dink mense alternatiewe energiebronne soos hernubare energiebronne behoort te ondersoek en hoe dit die aarde kan help .

source: learner dependent answer but assess whether learner has the ability to present an argument and justify their reasoning .
af: antwoorde hang van leerders af maar jy moet assesseer of 'n leerder die vermo&#235; het om 'n argument aan te bied en te motiveer .

source: one of the reasons which learners could present includes the fact that our reliance on non renewable energy resources is not sustainable and poses a problem for the future if they run out .
af: sommige van die redes wat die leerders kan voorhou is die feit dat ons afhanklikheid van nie hernubare energiebronne nie volhoubaar is nie en 'n toekomstige probleem kan raak as dit opraak .

source: furthermore burning fossil fuels has a severe environmental impact as the carbon dioxide released contributes to greenhouse gases and global warming .
af: die verbranding van fossielbrandstowwe het ook 'n ernstige impak op die omgewing aangesien die koolstofdioksied wat vrygestel word bydra tot kweekhuisgasse en aardverwarming .

source: what type of electrical appliances in our homes use the most energy in a specific time ?
af: watter soort elektriese toestelle in ons huis gebruik die meeste energie in 'n spesifieke tyd ?

source: this depends on the activity and usage but the most energy will probably be used by heating devices such as a geyser or heater .
af: afhangend van die aktiwiteit maar gewoonlik toestelle wat hitte verskaf soos 'n warmwatersilinder of verwarmer .

source: imagine that you are writing an article for your local newspaper on how to save electricity in your homes .
af: verbeel jou jy moet 'n artikel vir jou plaaslike koerant skryf oor hoe om elektrisiteit in jou huis te bespaar .

source: use your imagination to write your article telling people how to save electricity .
af: gebruik jou verbeelding en skryf jou artikel waarin jy vir mense s&#234; hoe om elektrisiteit te bespaar .

source: use the space below .
af: gebruik die spasie hieronder .

source: give your article a catchy heading .
af: gee vir jou artikel 'n treffende titel .

source: assess learner's ability to write creatively about a science related topic .
af: assesseer leerders se vermo&#235; om kreatief oor 'n wetenskapverwante onderwerp te skryf .
